espressif/esp-idf/components/soc/esp32h21/register/soc/efuse_struct.h
/**
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: program_data registers */
/** Type of pgm_datan register
 *  Represents pgm_datan
 */
typedef union {
    struct {
        /** pgm_data_n : R/W; bitpos: [31:0]; default: 0;
         *  Configures the nth 32-bit data to be programmed.
         */
        uint32_t pgm_data_n:32;
    };
    uint32_t val;
} efuse_pgm_datan_reg_t;

/** Type of pgm_check_valuen register
 *  Represents pgm_check_valuen
 */
typedef union {
    struct {
        /** pgm_rs_data_n : R/W; bitpos: [31:0]; default: 0;
         *  Configures the nth RS code to be programmed.
         */
        uint32_t pgm_rs_data_n:32;
    };
    uint32_t val;
} efuse_pgm_check_valuen_reg_t;


/** Group: block0 registers */
/** Type of rd_wr_dis register
 *  Represents rd_wr_dis
 */
typedef union {
    struct {
        /** wr_dis : RO; bitpos: [31:0]; default: 0;
         *  Represents whether programming of individual eFuse memory bit is disabled or
         *  enabled.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t wr_dis:32;
    };
    uint32_t val;
} efuse_rd_wr_dis_reg_t;

/** Type of rd_repeat_data0 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** rd_dis : RO; bitpos: [6:0]; default: 0;
         *  Represents whether reading of individual eFuse block(block4~block10) is disabled or
         *  enabled.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t rd_dis:7;
        /** pvt_glitch_en : RO; bitpos: [7]; default: 0;
         *  Represents whether to enable PVT power glitch monitor function.\\1: Enable. \\0:
         *  Disable\\
         */
        uint32_t pvt_glitch_en:1;
        /** dis_icache : RO; bitpos: [8]; default: 0;
         *  Represents whether icache is disabled or enabled.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t dis_icache:1;
        /** dis_usb_jtag : RO; bitpos: [9]; default: 0;
         *  Represents whether the USB-to-JTAG function in USB Serial/JTAG is disabled. \\ 1:
         *  Disabled\\ 0: Enabled\\
         */
        uint32_t dis_usb_jtag:1;
        /** powerglitch_en : RO; bitpos: [10]; default: 0;
         *  Represents whether to enable power glitch function.\\
         */
        uint32_t powerglitch_en:1;
        /** dis_usb_serial_jtag : RO; bitpos: [11]; default: 0;
         *  Represents whether to disable USB-Serial-JTAG.\\
         */
        uint32_t dis_usb_serial_jtag:1;
        /** dis_force_download : RO; bitpos: [12]; default: 0;
         *  Represents whether the function that forces chip into Download mode is disabled. \\
         *  1: Disabled\\ 0: Enabled\\
         */
        uint32_t dis_force_download:1;
        /** spi_download_mspi_dis : RO; bitpos: [13]; default: 0;
         *  Represents accessing MSPI flash/MSPI RAM by SYS AXI matrix is disabled during
         *  boot_mode_download.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t spi_download_mspi_dis:1;
        /** dis_twai : RO; bitpos: [14]; default: 0;
         *  Represents whether TWAI function is disabled. \\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t dis_twai:1;
        /** jtag_sel_enable : RO; bitpos: [15]; default: 0;
         *  Represents whether the selection of a JTAG signal source through the strapping pin
         *  value is enabled when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are configured
         *  to 0. For more information, please refer to Chapter Placeholder.\\ 1: Enabled\\ 0:
         *  Disabled\\
         */
        uint32_t jtag_sel_enable:1;
        /** soft_dis_jtag : RO; bitpos: [18:16]; default: 0;
         *  Represents whether PAD JTAG is disabled in the soft way. It can be restarted via
         *  HMAC. \\ Odd count of bits with a value of 1: Disabled\\ Even count of bits with a
         *  value of 1: Enabled\\
         */
        uint32_t soft_dis_jtag:3;
        /** dis_pad_jtag : RO; bitpos: [19]; default: 0;
         *  Represents whether PAD JTAG is disabled in the hard way (permanently).\\ 1:
         *  Disabled\\ 0: Enabled\\
         */
        uint32_t dis_pad_jtag:1;
        /** dis_download_manual_encrypt : RO; bitpos: [20]; default: 0;
         *  Represents whether flash encryption is disabled (except in SPI boot mode).\\ 1:
         *  Disabled\\ 0: Enabled\\
         */
        uint32_t dis_download_manual_encrypt:1;
        /** usb_drefh : RO; bitpos: [22:21]; default: 0;
         *  Represents single-end input threshold vrefh, 1.76 V to 2 V with step of 80 mV,
         *  stored in eFuse.\\
         */
        uint32_t usb_drefh:2;
        /** usb_drefl : RO; bitpos: [24:23]; default: 0;
         *  Represents single-end input threshold vrefl, 0.8 V to 1.04 V with step of 80 mV,
         *  stored in eFuse.\\
         */
        uint32_t usb_drefl:2;
        /** usb_exchg_pins : RO; bitpos: [25]; default: 0;
         *  Represents whether the D+ and D- pins is exchanged.\\ 1: Exchanged\\ 0: Not
         *  exchanged\\
         */
        uint32_t usb_exchg_pins:1;
        /** vdd_spi_as_gpio : RO; bitpos: [26]; default: 0;
         *  Represents whether vdd spi pin is functioned as gpio.\\ 1: Functioned\\ 0: Not
         *  functioned\\
         */
        uint32_t vdd_spi_as_gpio:1;
        /** ecdsa_curve_mode : RO; bitpos: [28:27]; default: 0;
         *  Represents the configuration of the curve of ECDSA calculation.\\ 0: Only enable
         *  P256\\ 1: Only enable P192\\ 2: Both enable P256 and P192\\ 3: Only enable P256\\
         */
        uint32_t ecdsa_curve_mode:2;
        /** ecc_force_const_time : RO; bitpos: [29]; default: 0;
         *  Represents whether to permanently turn on ECC const-time mode.\\ 0: Disabled\\ 1:
         *  Enabled\\
         */
        uint32_t ecc_force_const_time:1;
        /** xts_dpa_pseudo_level : RO; bitpos: [31:30]; default: 0;
         *  Represents control method of xts pseudo-round anti-dpa attack function.\\ 0:
         *  Controlled by register\\ 1-3: The higher the value is, the more pseudo-rounds are
         *  inserted to the xts-aes calculation.\\
         */
        uint32_t xts_dpa_pseudo_level:2;
    };
    uint32_t val;
} efuse_rd_repeat_data0_reg_t;

/** Type of rd_repeat_data1 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** io_ldo_adjust : RO; bitpos: [7:0]; default: 0;
         *  Represents configuration of IO LDO mode and voltage.\\
         */
        uint32_t io_ldo_adjust:8;
        /** vdd_spi_ldo_adjust : RO; bitpos: [15:8]; default: 0;
         *  Represents configuration of FLASH LDO mode and voltage.\\
         */
        uint32_t vdd_spi_ldo_adjust:8;
        /** wdt_delay_sel : RO; bitpos: [17:16]; default: 0;
         *  Represents RTC watchdog timeout threshold. 0: The originally configured STG0
         *  threshold x 2 1: The originally configured STG0 threshold x 4 2: The originally
         *  configured STG0 threshold x 8 3: The originally configured STG0 threshold x 16
         */
        uint32_t wdt_delay_sel:2;
        /** spi_boot_crypt_cnt : RO; bitpos: [20:18]; default: 0;
         *  Represents whether SPI boot encryption/decryption is enabled. \\ Odd count of bits
         *  with a value of 1: Enabled\\ Even count of bits with a value of 1: Disabled\\
         */
        uint32_t spi_boot_crypt_cnt:3;
        /** secure_boot_key_revoke0 : RO; bitpos: [21]; default: 0;
         *  Represents whether revoking Secure Boot key 0 is enabled. \\ 1: Enabled\\ 0:
         *  Disabled\\
         */
        uint32_t secure_boot_key_revoke0:1;
        /** secure_boot_key_revoke1 : RO; bitpos: [22]; default: 0;
         *  Represents whether revoking Secure Boot key 1 is enabled. \\ 1: Enabled\\ 0:
         *  Disabled\\
         */
        uint32_t secure_boot_key_revoke1:1;
        /** secure_boot_key_revoke2 : RO; bitpos: [23]; default: 0;
         *  Represents whether revoking Secure Boot key 2 is enabled. \\ 1: Enabled\\ 0:
         *  Disabled\\
         */
        uint32_t secure_boot_key_revoke2:1;
        /** key_purpose_0 : RO; bitpos: [27:24]; default: 0;
         *  Represents the purpose of Key0. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_0:4;
        /** key_purpose_1 : RO; bitpos: [31:28]; default: 0;
         *  Represents the purpose of Key1. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_1:4;
    };
    uint32_t val;
} efuse_rd_repeat_data1_reg_t;

/** Type of rd_repeat_data2 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** key_purpose_2 : RO; bitpos: [3:0]; default: 0;
         *  Represents the purpose of Key2. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_2:4;
        /** key_purpose_3 : RO; bitpos: [7:4]; default: 0;
         *  Represents the purpose of Key3. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_3:4;
        /** key_purpose_4 : RO; bitpos: [11:8]; default: 0;
         *  Represents the purpose of Key4. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_4:4;
        /** key_purpose_5 : RO; bitpos: [15:12]; default: 0;
         *  Represents the purpose of Key5. See Table tab:efuse-key-purpose.\\
         */
        uint32_t key_purpose_5:4;
        /** sec_dpa_level : RO; bitpos: [17:16]; default: 0;
         *  Represents the security level of anti-DPA attack. The level is adjusted by
         *  configuring the clock random frequency division mode.\\ 0: Security level is
         *  SEC_DPA_OFF\\ 1: Security level is SEC_DPA_LOW\\ 2: Security level is
         *  SEC_DPA_MIDDLE\\ 3: Security level is SEC_DPA_HIGH\\ For more information, please
         *  refer to Chapter mod:sysreg > Section sec:sysreg-anti-dpa-attack-security-control.\\
         */
        uint32_t sec_dpa_level:2;
        /** io_ldo_1p8 : RO; bitpos: [18]; default: 0;
         *  Represents select IO LDO voltage to 1.8V or 3.3V.\\ 1: 1.8V\\ 0: 3.3V\\
         */
        uint32_t io_ldo_1p8:1;
        /** crypt_dpa_enable : RO; bitpos: [19]; default: 0;
         *  Represents whether defense against DPA attack is enabled.\\ 1: Enabled\\ 0:
         *  Disabled\\
         */
        uint32_t crypt_dpa_enable:1;
        /** secure_boot_en : RO; bitpos: [20]; default: 0;
         *  Represents whether Secure Boot is enabled.\\ 1: Enabled\\ 0: Disabled\\
         */
        uint32_t secure_boot_en:1;
        /** secure_boot_aggressive_revoke : RO; bitpos: [21]; default: 0;
         *  Represents whether aggressive revocation of Secure Boot is enabled.\\ 1: Enabled\\
         *  0: Disabled\\
         */
        uint32_t secure_boot_aggressive_revoke:1;
        /** powerglitch_en1 : RO; bitpos: [26:22]; default: 0;
         *  Represents whether to enable power glitch function when chip power on.\\
         */
        uint32_t powerglitch_en1:5;
        /** dcdc_ccm_en : RO; bitpos: [27]; default: 0;
         *  Represents whether change DCDC to CCM mode.
         */
        uint32_t dcdc_ccm_en:1;
        /** flash_tpuw : RO; bitpos: [31:28]; default: 0;
         *  Represents the flash waiting time after power-up. Measurement unit: ms.\\ When the
         *  value is less than 15, the waiting time is the programmed value. Otherwise, the
         *  waiting time is a fixed value, i.e. 30 ms.\\
         */
        uint32_t flash_tpuw:4;
    };
    uint32_t val;
} efuse_rd_repeat_data2_reg_t;

