espressif/esp-idf/components/soc/esp32h21/register/soc/efuse_struct.h
/** Type of rd_repeat_data3 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** dis_download_mode : RO; bitpos: [0]; default: 0;
         *  Represents whether all download modes are disabled.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t dis_download_mode:1;
        /** dis_direct_boot : RO; bitpos: [1]; default: 0;
         *  Represents whether direct boot mode is disabled.\\ 1: Disabled\\ 0: Enabled\\
         */
        uint32_t dis_direct_boot:1;
        /** dis_usb_serial_jtag_rom_print : RO; bitpos: [2]; default: 0;
         *  Represents whether print from USB-Serial-JTAG during ROM boot is disabled.\\ 1:
         *  Disabled\\ 0: Enabled\\
         */
        uint32_t dis_usb_serial_jtag_rom_print:1;
        /** flash_ldo_efuse_sel : RO; bitpos: [3]; default: 0;
         *  Represents whether to select efuse control flash ldo default voltage. \\1:
         *  efuse\\0: strapping\\
         */
        uint32_t flash_ldo_efuse_sel:1;
        /** dis_usb_serial_jtag_download_mode : RO; bitpos: [4]; default: 0;
         *  Represents whether the USB-Serial-JTAG download function is disabled.\\ 1:
         *  Disabled\\ 0: Enabled\\
         */
        uint32_t dis_usb_serial_jtag_download_mode:1;
        /** enable_security_download : RO; bitpos: [5]; default: 0;
         *  Represents whether security download is enabled. Only UART is supported for
         *  download. Reading/writing RAM or registers is not supported (i.e. Stub download is
         *  not supported).\\ 1: Enabled\\ 0: Disabled\\
         */
        uint32_t enable_security_download:1;
        /** uart_print_control : RO; bitpos: [7:6]; default: 0;
         *  Represents the type of UART printing.\\ 0: Force enable printing.\\ 1: Enable
         *  printing when GPIO8 is reset at low level.\\ 2: Enable printing when GPIO8 is reset
         *  at high level.\\ 3: Force disable printing.\\
         */
        uint32_t uart_print_control:2;
        /** force_send_resume : RO; bitpos: [8]; default: 0;
         *  Represents whether ROM code is forced to send a resume command during SPI boot.\\
         *  1: Forced\\ 0: Not forced\\
         */
        uint32_t force_send_resume:1;
        /** secure_version : RO; bitpos: [24:9]; default: 0;
         *  Represents the security version used by ESP-IDF anti-rollback feature.\\
         */
        uint32_t secure_version:16;
        /** secure_boot_disable_fast_wake : RO; bitpos: [25]; default: 0;
         *  Represents whether FAST VERIFY ON WAKE is disabled when Secure Boot is enabled.\\
         *  1: Disabled\\ 0: Enabled\\
         */
        uint32_t secure_boot_disable_fast_wake:1;
        /** hys_en_pad0 : RO; bitpos: [31:26]; default: 0;
         *  Represents whether to enable the hysteresis function of pad 0-5.\\ 0: Disabled\\ 1:
         *  Enabled\\
         */
        uint32_t hys_en_pad0:6;
    };
    uint32_t val;
} efuse_rd_repeat_data3_reg_t;

/** Type of rd_repeat_data4 register
 *  Represents rd_repeat_data
 */
typedef union {
    struct {
        /** hys_en_pad1 : RO; bitpos: [21:0]; default: 0;
         *  Represents whether to enable the hysteresis function of pad 6-27.\\ 0: Disabled\\
         *  1: Enabled\\
         */
        uint32_t hys_en_pad1:22;
        /** flash_ldo_power_sel : RO; bitpos: [22]; default: 0;
         *  Represents which flash LDO is selected.\\ 0: FLASH LDO 1P8.\\ 1: FLASH LDO 1P2.\\
         */
        uint32_t flash_ldo_power_sel:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} efuse_rd_repeat_data4_reg_t;


/** Group: block1 registers */
/** Type of rd_mac_sys0 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_0 : RO; bitpos: [31:0]; default: 0;
         *  Represents MAC address. Low 32-bit.
         */
        uint32_t mac_0:32;
    };
    uint32_t val;
} efuse_rd_mac_sys0_reg_t;

/** Type of rd_mac_sys1 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_1 : RO; bitpos: [15:0]; default: 0;
         *  Represents MAC address. High 16-bit.
         */
        uint32_t mac_1:16;
        /** mac_ext : RO; bitpos: [31:16]; default: 0;
         *  Represents the extended bits of MAC address.
         */
        uint32_t mac_ext:16;
    };
    uint32_t val;
} efuse_rd_mac_sys1_reg_t;

/** Type of rd_mac_sys2 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_reserved_0 : RO; bitpos: [13:0]; default: 0;
         *  Reserved.
         */
        uint32_t mac_reserved_0:14;
        /** mac_reserved_1 : RO; bitpos: [31:14]; default: 0;
         *  Reserved.
         */
        uint32_t mac_reserved_1:18;
    };
    uint32_t val;
} efuse_rd_mac_sys2_reg_t;

/** Type of rd_mac_sys3 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        /** mac_reserved_2 : RO; bitpos: [3:0]; default: 0;
         *  Reserved.
         */
        uint32_t mac_reserved_2:4;
        /** pvt_cell_select : RO; bitpos: [10:4]; default: 0;
         *  Represents the selection of Power glitch monitor PVT cell.\\
         */
        uint32_t pvt_cell_select:7;
        /** mac_reserved_3 : RO; bitpos: [17:11]; default: 0;
         *  Reserved.
         */
        uint32_t mac_reserved_3:7;
        /** blk_version_minor : R; bitpos: [20:18]; default: 0;
         *  Minor version of BLOCK2
         */
        uint32_t blk_version_minor:3;
        /** blk_version_major : R; bitpos: [22:21]; default: 0;
         *  Major version of BLOCK2
         */
        uint32_t blk_version_major:2;
        /** disable_blk_version_major : R; bitpos: [23]; default: 0;
         *  Disables check of blk version major
         */
        uint32_t disable_blk_version_major:1;
        /** flash_cap : R; bitpos: [26:24]; default: 0;
         *  Mark the capacity of in-package Flash
         */
        uint32_t flash_cap:3;
        /** flash_vendor : R; bitpos: [29:27]; default: 0;
         *  Mark the vendor of in-package Flash
         */
        uint32_t flash_vendor:3;
        /** temp : R; bitpos: [31:30]; default: 0;
         *  Mark the specified maximum ambient temperature that ESP Chip can work properly
         */
        uint32_t temp:2;
    };
    uint32_t val;
} efuse_rd_mac_sys3_reg_t;

/** Type of rd_mac_sys4 register
 *  Represents rd_mac_sys
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** pvt_limit : RO; bitpos: [20:5]; default: 0;
         *  Represents the threshold of power glitch monitor.\\
         */
        uint32_t pvt_limit:16;
        /** pvt_glitch_charge_reset : RO; bitpos: [21]; default: 0;
         *  Represents whether to trigger reset or charge pump when PVT power glitch
         *  happened.\\ 1:Trigger charge pump. \\ 0:Trigger reset\\
         */
        uint32_t pvt_glitch_charge_reset:1;
        /** pvt_glitch_mode : RO; bitpos: [23:22]; default: 0;
         *  Represents the configuration of glitch mode.\\
         */
        uint32_t pvt_glitch_mode:2;
        /** pvt_pump_limit : RO; bitpos: [31:24]; default: 0;
         *  Represents the configuration voltage monitor limit for charge pump.\\
         */
        uint32_t pvt_pump_limit:8;
    };
    uint32_t val;
} efuse_rd_mac_sys4_reg_t;

